Adds AsyncAPI and GraphQL as first class cititzens
